import React from 'react'

const AboutUs = () => {
    return (
        <div>
            <div className="bg-[url('https://tursab118.com/templates/charter118/about.jpg')] h-[550px] px-0 py-[40px] relative bg-center bg-cover bg-fixed">
                <div className='absolute w-[100%] top-[-1px] overflow-hidden'>
                    <svg width="1998" height="109" version="1.1" x="0px" y="0px" viewBox="0 0 1998.1 109" style={{ backgroundColor: 'new 0 0 1998 109', enableBackground: 'new 0 0 1998 109' }} >
                        <path opacity="0.2" fill="#f7f7f7" d="M-1,107.6c346,0.6,524.3,4.7,878.4-4.4c286.6-7.4,442.5-54,608.3-51.2c205.4,3.5,310.3,72.8,513.3,49.7V1.2L-1,1.7V107.6z"></path>
                        <path opacity="0.2" fill="#f7f7f7" d="M1997.5,83.8c-251.3,30.8-441.2-38.7-499.9-52.4c-54.7-12.8-122.5-12-186.7,5.3c-154.2,41.6-315.5,70.9-475.2,67.5c-159.6-3.4-324.4-22.4-484.1-19.7C218.6,86.8,49,82.8-1,80.8C-1,59.5-1,1.1-1,1.1h1998.8L1997.5,83.8z"></path>
                        <path opacity="0.4" fill="#f7f7f7" d="M-2,88.7c139.8,12.7,219.9,10.7,360.2,11.1c285.5,0.8,487.5-18.1,736.2-51.2C1351,14.4,1451.5,13.3,1799,76.2c58.9,10.6,140,8,200,1.3V0H-1.5L-2,88.7z"></path>
                        <path fill="#f7f7f7" d="M362.6,79.6c193.8-11.8,366.7-24.8,568.8-49.9c110.2-13.7,221.1-21.6,332.2-19.6c187,3.3,344.8,29.7,561.3,69.8c122.2,22.6,173.2,4,173.2,4V0H0v83.7C0,83.7,166.1,91.7,362.6,79.6z"></path>
                    </svg>
                </div>
                <div className='absolute w-[100%] bottom-0 rotate-180 overflow-hidden'>
                    <svg width="1998" height="109" version="1.1" x="0px" y="0px" viewBox="0 0 1998.1 109" style={{ backgroundColor: 'new 0 0 1998 109', enableBackground: 'new 0 0 1998 109' }} >
                        <path opacity="0.2" fill="#f7f7f7" d="M-1,107.6c346,0.6,524.3,4.7,878.4-4.4c286.6-7.4,442.5-54,608.3-51.2c205.4,3.5,310.3,72.8,513.3,49.7V1.2L-1,1.7V107.6z"></path>
                        <path opacity="0.2" fill="#f7f7f7" d="M1997.5,83.8c-251.3,30.8-441.2-38.7-499.9-52.4c-54.7-12.8-122.5-12-186.7,5.3c-154.2,41.6-315.5,70.9-475.2,67.5c-159.6-3.4-324.4-22.4-484.1-19.7C218.6,86.8,49,82.8-1,80.8C-1,59.5-1,1.1-1,1.1h1998.8L1997.5,83.8z"></path>
                        <path opacity="0.4" fill="#f7f7f7" d="M-2,88.7c139.8,12.7,219.9,10.7,360.2,11.1c285.5,0.8,487.5-18.1,736.2-51.2C1351,14.4,1451.5,13.3,1799,76.2c58.9,10.6,140,8,200,1.3V0H-1.5L-2,88.7z"></path>
                        <path fill="#f7f7f7" d="M362.6,79.6c193.8-11.8,366.7-24.8,568.8-49.9c110.2-13.7,221.1-21.6,332.2-19.6c187,3.3,344.8,29.7,561.3,69.8c122.2,22.6,173.2,4,173.2,4V0H0v83.7C0,83.7,166.1,91.7,362.6,79.6z"></path>
                    </svg>
                </div>
                <div className='absolute flex w-[80%] h-[250px] right-[10%] top-[150px] gap-x-[90px]'>
                    <div className='w-[70%]'>
                        <p className='text-white text-sm font-[400]'>درباره ما</p>
                        <p className='mt-[20px] text-white text-sm font-[400] leading-7'>بلیط چارتر هواپیما خود را از ما بخواهید. چارتر 118 (charter118) با بیش یک دهه تجربه در فروش انواع بلیط هواپیما از جمله چارتری و سیستمی توانسته رضایت مشتریان خود را جلب کند. ما در مجموعه چارتر 118 انواع بلیط لحظه آخری هواپیما و بلیط ارزان هواپیما را برای شما عزیزان آماده کرده ایم تا بتوانید با خیالی راحت و آسود نسبت به خرید بلیط خود اقدام کنید. در چارتر 118 میتوانید انواع هتل های داخلی و خارجی نیز مشاهده و رزرو کنید. همچنین انواع تورهای جذاب داخلی و خارجی را چارتر 118 با قیمت‌های ویژه برای شما آماده کرده است تا سفری دلنشین و خاطره انگیز همراه ما داشته باشید.</p>
                        <button className='bg-[#c873eb] text-white w-[70px] h-[30px] rounded pb-[2px] float-left mt-[20px]'>بیشتر</button>
                    </div>
                    <div className='w-[30%]'>
                        <p className='text-white text-sm font-[400]'>اطلاعیه های سایت</p>
                        <div className='mt-[20px] text-white text-sm font-[400] leading-7'>
                            <div className="scroller">
                                <div>
                                    روش تهیه بلیط هواپیما
                                    <br />
                                    آموزش رزرو بلیط هواپیما و چارتر
                                    <br />
                                    سامانه ثبت شکایات
                                    <br />
                                    جریمه استرداد بلیط هواپیما سیستمی
                                    <br />
                                    قوانین بلیط هواپیما چارتر
                                    <br />
                                    فهرست شرکت‌های هواپیمایی ایرانی
                                    <br />
                                    همکاری چارتر 118 با شرکت ها . سازمان ها
                                    <br />
                                    سامانه ثبت شکایات
                                </div>

                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default AboutUs
